Repository: mozilla-l10n/mt-training-data
Catalog: phr/phr_pontoon.tmx
Source language: en_us
Languages: phr

source: { $uploadedQuestions } of { $totalQuestions } questions collected. View our <guidelinesLink>Guidelines</guidelinesLink> pages to learn more about how to add questions
phr: ہور { $uploadedQuestions } اچا { $totalQuestions } سوال جمع ہوئی اے۔ ۔سوال شامل کرنے نے بارے اچ سیکھنے آسطے اساں نا گائیڈ لائن پیج </guidelinesLink> دیخا

source: Upload failed, please retry.
phr: اپ لوڈ نی ہوئی سکیا، فیر کوشش کرا۔

source: Upload of this clip keeps failing at server. Reload the page or try again later.
phr: اس کلپ نی اپ لوڈنگ سرور اوپر نی ہوئی سکی۔ پیج کی ری لوڈ کرا یا بعد اچ کوشش کرا۔

source: Upload of this clip keeps failing, keep retrying?
phr: اس کلپ نی اپ لوڈنگ نی ہوئی سکی۔ فیر کوشش کرلے آ؟

source: Urdu
phr: اُردو

source: Use correct spelling and grammar
phr: ٹھیک سپیلنگ تے گرامر استعمال کرا

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
phr: استمال کرن آلے چیک کرنے کے پڑنے آلے جملے ٹھیک پڑے تے تصدیق کرنے کے ریکارڈنگ ٹھیک زی

source: Ushojo
phr: اشوجو

source: Uyghur
phr: ایغور

source: Uzbek
phr: ازبک

source: Validate Readings
phr: ریکارڈنگ نی تصدیق کرا

source: Validate Readings, Review Transcriptions
phr: ریکارڈنگ نی تصدیق کرا، تحریر کی ریویو کرا

source: Validate Readings <small>(Coming soon)</small>
phr: ریکارڈنگ نی تصدیق کرا <small>(جلدی اچھی ریلے)

source: Validate readings submitted by community members
phr: کمیونٹی نے لوکاں نی طرفاں جمع ہوئی ریکارڈنگ نی تصدیق کرا

source: Validate user-recorded readings in your language
phr: تُساں نی زبان اچ ریکارڈ ہوئی ریکارڈنگ نی تصدیق کرا

source: Value and recognition.
phr: قدر تے پہچان۔

source: Varying Pronunciations
phr: مختتلف بولنے ناں انداز

source: Venetian
phr: وینیشین

source: Vietnamese
phr: ویتنامی

source: Voice clips are entered into a submission queue that readies them for listening.
phr: سننے آسطے تیار ہونے سی پہلے جملیاں نی ریکارڈنگ انتظار نی لائن اچ شامل ہونی

source: Voice Contribution
phr: آواز شامل کرنے اچ حصہ

source: Voice Dataset, Ready for Download
phr: آواز نا ڈیٹا سیٹ، ڈائون لوڈ آسطے تیار

source: Voice Validation
phr: آواز نی تصدیق

source: Votic
phr: ووٹک

source: Wakhi
phr: وخی

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
phr: کامن وائس کی بہتر کرنے آسطے مدد کرلے آ؟ زبردست! ای میل کری رابطہ کرا یا گل بات نے فرام سیں۔ سائٹ نے مسلے گٹ ہب نے ذریعے پیش کرا یا فیر کمیونٹی چیٹ نی میٹرکس اچ شامل ہوا

source: Want to stay in touch with Common Voice?
phr: کامن وائس کنے رابطے اچ رہناں چانے آ؟

source: Watch our video explainer to help
phr: مدد آسطے اساں نیاں تفصیل نیاں ویڈیو دیخو

source: Wayuunaiki
phr: وایونائیکی

source: We are always looking to hear from data consumers about their needs and context - from collaborating on data collection platform to providing data health insights, we want to <emailFragment>hear from you.</emailFragment>
phr: اس ڈیٹا استعمال کرنے آلیاں کولاں ہر ویلے سننا چانے آں اناں نی ضرورتاں تے سیاق و سباق نے بارے اچ۔ ڈیٹا جمع کرنے نے پلیٹ فارم اوپر رابطہ کری ڈیٹا نے بارے اچ تجویزاں آسطے اس تُساں کولاں سنناں چانے آں۔

source: We are excited to support public sector engagement in technology, innovation and language rights. If you're planning to run a major project or campaign, please do <emailFragment>get in touch.</emailFragment>
phr: اس ٹیکنالوجی، جدت تے زباناں نے حقوق اچ حکومتی شمولیت نے بارے اچ بہوں پُر جوش زیاں۔ اگر تس کوئی بڑا پروجیکٹ یا مہم چلانا چانے آ، تے اساں کنے رابطے آسطے ای میل کرا<emailFragment>۔

source: We are going out to get a coffee.
phr: اس بار کافی پینے کیا جلنے آں۔

source: We are going out to get coffee.
phr: اس بار کافی پینے کیا جلنے آں۔

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
phr: اس موزیلا اوپر آواز نی ٹیکنالوجی نے چفیری ہک کمیونیٹی بنانے آں۔ اس رابطے اچ رہنا چانے آں نویں خبر کنے، نویں ڈیٹا نے ذرائع کنے تے اس بارے اچ سنی کے تُس ڈیٹا کس طرح استعمال کرنے آ۔

source: Website Localization
phr: ویب سائٹ کی مقامی بنانا

source: We couldn’t find that page for you
phr: اساں کی تساں آسطے اوہ پیج نی لبا۔

source: We couldn’t get any audio clips for you to listen to. Please try again later.
phr: تُساں نے سُننے آسطے اساں کوئی آڈیو کلپ نی لبا۔ مہربانی کری بعد اچ کوشش کرا۔

source: We launch the Common Voice site in this language.
phr: اس کامن وائس سائٹ کیا اس زباناں اچ شروع کرنے آں

source: Welcome to Common Voice
phr: کامن وائس اچ تُساں کی خوش آمدید

source: Welsh
phr: ویلش

source: We may have run out of clips - refresh the page, or try again later.
phr: شائد کلپ ختم ہوئی غئے- پیج فیر چلائو یا بعد اچ فیر کوشش کرا۔

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
phr: اس وعدہ کرنے آں کہ تُساں نی معلومات کیا بہوں احتیاط کنے سنبھالنے آں۔ اساں نی رازداری نے نوٹس اچ ہور پڑھا</privacyLink>۔

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
phr: اس بہوں سارے لوکاں کی شامل کری آوازں ناں ڈیٹا سیٹ بنانے اوپر کم کرے لغے نیاں۔ تس اپنی آواز شامل کرا،باقی لوکاں نی ریکارڈنگ نی تصدیق کرا تے اس ڈیٹا بیس کی ساریاں آسطے بہتربنانے اچ مدد کرا۔

source: We’re experiencing unexpected downtime
phr: اساں کی غیر متوقع بند وقت ناں سامںا زا۔

source: We’re going out to get coffee.
phr: اس بار کافی پینے کیا جلے آں۔

source: We release the dataset every 3 months.
phr: ہر تن مینیاں بعد اس ڈیٹا سیٹ جاری کرنے آں

source: We're receiving a lot of traffic and are currently investigating the issues.
phr: اساں کی بہوں زیادہ ٹریفک اشنی تے اس مسلے نی تفتیش کرے لغے نے آں

source: Western Highland Purepecha
phr: مغربی ہائی لینڈ پورپیچا

source: Western Sierra Puebla Nahuatl
phr: مغربی سیرا پیوبلا ناہوت

source: Westphalian
phr: ویسٹ فیلین

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
phr: اس ترجمے آسطے یک موزیلا ٹول استعمال کرنے آں جس کی پنٹون آخنے</pontoonLink>۔ پنٹون اچ بہوں ساری زباناں زیاں اگر تساں نی زبان اس اچ نہیں تے تس اپنی زبان شامل کرنے نی درخواست کری سکنے آ </pontoonRequestLink>۔ فیر اپنی زباناں کی کامن وائس پروجیکٹ اوپر ظاہر کرنے اسطے نویں زبان نی گٹ ہب</githubRepoLink> اوپر درخواست کرا۔ سائٹ نے ترجمے نے بارے اچ ہور دیخا </localizationFragment>۔

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
phr: اس چاہنے آں کے سپیچ ماڈل مختلف بولنے آلیاں کی سمجھنے آسطے بہتر ہوئے۔ اس آسطے وائس ڈیٹا سیٹ اوپر بہوں سارے مختلف لوک ہونے چاینے

source: We will be in touch with more information about how to add your language to Common Voice very soon.
phr: تساں نی زبان کامن وائس اوپر شامل کرنے نے بارے اچ تساں کنے اس جلدی رابطہ کرساں

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
phr: اس آواز نی ریکارڈنگ کی ہٹانے نی تُساں نی درخواست کی ریویو کرلے آں۔ اگر درخواست منظور ہوئی غئی، تے جنہاں ڈیٹا سیٹ کی ڈائون لوڈ کتا نا اس اناں کی وی درخواست کرساں کے اوہ وی آواز نی ریکارڈنگ کیا ڈیلیٹ کرن۔

source: We work with foundations, civil society and community partners to make the internet a healthier place, with a particular focus on East Africa. Learn more about our <programmaticWork>programmatic work.</programmaticWork>
phr: اس تنظیماں، سول سوسائٹی، تے کمیونیٹی نے شرکت داراں کنے انٹرنیٹ کی صحت مند جغہ بنانے آسطے کم کرنے آ، تے اساں نی خاص توجہ مشرقی افریقہ اوپر زی۔ اساں نے پروگراماں نے کم بارے اچ ہور معلوم کرا۔

source: What is a language on Common Voice?
phr: کامن وائس اوپر ہک زبان کیہہ زی

source: What issues are you experiencing with this content?
phr: اس مواد کنے تساں کی کے مسلہ پیش انا؟

source: What issues are you experiencing with this sentence?
phr: اس جملے کنے تساں کی کے مسلہ پیش انا؟

source: What is your age?
phr: تسان نی عمر کتنی زی؟

source: What is your sex or gender?
phr: تُسان نی جنس کے زی؟

source: What questions can I add?
phr: میں کس طرح نے سوال شامل کری سکنس؟

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
phr: جذوں استمال کرن آلا کسے ریکارڈنگ کیا مسترد کرنا تے او واپس لائن اچ چلی غنی۔ اگر دو واری مسترد ہوئی اچھے تے او ریکارڈنگ کلپ نی قبراچ چلی غنی

source: Why ?
phr: کیہاں

source: Why are you asking?
phr: تُس کیاں پُچھنے آ؟

source: Why Common Voice?
phr: کامن وائس کیہاں؟

source: Wixárika
phr: ویخاریکا

source: Wolof
phr: وولف

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
phr: تس اپنی رآواز نی ریکارڈنگ کی ڈیلیٹ کرنے نی درخواست کرلے آ، یا اس کی کامن وائس نے ڈیٹا سیٹ اچ رکھنا چانے آ؟

source: Write down what you hear the person saying here
phr: بندہ جو آخنا اس کی لخا۔

source: Xhosa
phr: ژوسا

source: Xitsonga
phr: شٹسونگا

source: y
phr: وائے

source: Yaqui
phr: یاقی

source: Yes
phr: ہاں

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
phr: جی ہاں۔ می کی ای میل کرا۔ میں کامن وائس پراجیکٹ نے بارے اچ باخبر رہنا چاناس

source: Yiddish
phr: یدش

source: Yoruba
phr: یوروبا

source: You can add sentences on the <writePageLink>Write page</writePageLink> or review sentences on the <reviewPageLink>Review page</reviewPageLink>.
phr: تس جملے رائٹ پیج اوپر شامل کری سکنے آ<writePageLink> یا ریویو پیج اوپر جملیاں کی ریویو کری سکنے آ </reviewPageLink>۔

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
phr: تس ڈیٹا سیٹس نے صفحے اوپر جلی سکنے آ، اپنی مرضی نان ورژن تے زباناں منتخب کری سکنے آ، تے اس کی ڈاؤن لوڈ کری سکنے آ! فائلاں کنے میٹا ڈیٹا جُڑیا ہونا، جیاں کے آبادیاتی معلومات تے تصدیق کا ڈیٹا۔ ڈیٹا سیٹ کی ڈاؤن لوڈ کرنے کے آسطے تساں کی ہک ای میل ایڈریس دینا ہوسی۔

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
phr: موزیلا نی زبان نی کمیونٹی اچ کسے موضوع اوپر گل کرنے آسطے ڈسکورس اچ شامل ہوئی یا فوری مشورے آسطےمیٹرکس اچ شامل ہوئی تس ہوراں کی وی ملی سکنے آ

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
phr: تس لوکاں نی مدد کرنے آسطے ایونٹس چلائی سکنے آ۔ اے تساں نی سوچ کولاں زیادہ آسان زا۔ تس اس کیا ویڈیو کانفرنسنگ ٹول کنے آن لائن کری سکنے آ، یا اگر محفوظ زا تےذاتی طور اوپر کری سکنے آ۔ ایونٹ کیا چلانے آسطے اساں نی ٹیمپلٹس<eventTemplate> تے وسائل کیا چیک کرا۔

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
phr: تس تھوڑے جئے جملے شامل کری سکنے آ </sentenceCollectorLinkAdd>، یا تس گٹ ہب </bulkImportDocsLink> نا استعمال کری بہوں سارے جملے شامل کری سکنے آ۔ ایہہ خیال رکھیا کہ جملے عوامی ہونے چاینے جناں نی اجازت ہونی چاینی یا تس اپنے جملے وی لخی سکنے آ۔

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
phr: تس جملیاں نا ایکسٹریکٹر استعمال کری وکی پیڈیا سی مختصر جملے وی ادھار ہنی سکنے آ

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
phr: تس پیغام پہچانے آسطے سوشل میڈیا پلیٹ فارم کی استعمال کری سکنے آ۔ ایسی پوسٹاں کی شئیر کرا جیہڑیاں دسنیاں کہ اس نی کیہ اہمیت زی، تے زبان نے حقوق، آواز نی مصنوعی ذہانت، یا ٹیکنالوجی اچ تعصب جئے مسلیاں نے بارے اچ ہور لوکاں کنے رابطہ کرا۔ سماجی مہم چلانے نے بارے اچ مزید مشورے دیخا، اس مواد سمیت جیہڑا تس دوبارہ استعمال کری سکنے آ۔

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
phr: تُسیں کوئِی زبان نئ چُنی۔ اپنی پروفائل <profileLink> اُپر گچھی تے زبان ناں انتخاب کرا

source: You have unsaved changes on this page. If you change the locale, your changes will not be saved. Are you sure you want to change the locale?
phr: اس پیج اوپر تساں ناں کم سیو نی ہویا۔ اگر تس لوکیل کی تبدیل کرنے آ، تساں ناں کم سیو نی ہون لغا۔ تُس واقعی اس پیج کی چھوڑنے آ؟

source: You have unsaved changes on this page. If you leave this page, your changes will not be saved. Are you sure you want to leave this page?
phr: اس پیج اوپر تساں ناں کم سیو نی ہویا۔ اگر تُس اس پیج کی چھوڑنے آ، تساں ناں کم سیو نی ہون لغا۔ تُس واقعی اس پیج کی چھوڑنے آ؟

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
phr: تساں نی ناں بغیرآواز نی ریکارڈنگ کامن وائس ڈیٹا سیٹ اچ موجود رہسی۔ تس اگر اپنی پروفائل ڈیلیٹ کرلے آ تے فیر تُس ڈیٹا سیٹ اچاں اپنی ریکارڈنگ ہٹانے نی درخواست نی کری سکنے آ

source: Your download has started.
phr: تساں نی ڈائون لوڈ شروع ہوئی غئی

source: You’re contributing to a target segment
phr: تس ٹارگٹ سیگمنٹ اچ شرکت کرنے لغے آ

source: You’re contributing to our first target segment
phr: تس اساں نے پہلے سیگمنٹ ٹارگٹ اچ شرکت کرنے لغے آ

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
phr: تُساں نی مختلف زبان نے کلپ شائد ختم ہوئی غئے! اگر تساں کی کوئی مسلہ نی، تُس اپنی زبان نے ہور جملے دیخنے آسطے سیٹنگ تبدیل کری سکنے آ۔

source: Zaza
phr: ززا

source: Zulu
phr: زولو

source: account recovery key
phr: اکائونٹ بحالی نی کنجی

source: add-on
phr: ایڈ-آن

source: alternate text
phr: متبادل تحریر

source: attack
phr: حملہ

source: attacker
phr: حملہ کرن آلا

source: Attack Site
phr: حلمے نی سائٹ

source: attendee
phr: حاضر

source: authenticate
phr: پروہسے آلا

source: autoplay
phr: خوچ چلائو
